In [ ]:
from sportsref.baseball import Franchise, Player

In [ ]:
rays = Franchise("Rays")

In [ ]:
rays1999 = rays.season(1999)

In [ ]:
rays1999

In [ ]:
rays1999.lineups()

In [ ]:
valid_table_types =  ['team_batting', 'team_pitching', 'appearances', 'standard_fielding',
                             'players_value_batting', 'players_value_pitching']

In [ ]:
for tbl in valid_table_types:
    print(tbl)
    display(rays1999.stats(tbl))

In [ ]:
for c in rays1999.stats().query("Pos == 'C'")["Name"]:
    print (c)
    display(Player(c).overview())

In [2]:
kratz = Player("eric kratz", False)

In [8]:
kratz.overview("batting_value")

,Year,Age,Tm,Lg,G,PA,Rbat,Rbaser,Rdp,Rfield,...,RAR,WAR,waaWL%,162WL%,oWAR,dWAR,oRAR,Salary,Pos,Awards
0,2010,30,PIT,NL,9,36,-5,-1,0,2,...,-2,-0.3,0.460,0.498,-0.5,0.3,-4,NaN,/2,NaN
1,2011,31,PHI,NL,2,6,0,0,0,0,...,0,0.0,0.511,0.500,0.0,0.0,0,NaN,/2,NaN
2,2012,32,PHI,NL,50,157,1,-1,0,6,...,14,1.4,0.519,0.506,0.7,0.9,8,NaN,2,NaN
3,2013,33,PHI,NL,68,218,-7,0,-2,-4,...,-1,-0.3,0.487,0.494,0.2,-0.1,3,"$496,000",2,NaN
4,2014,34,TOR,AL,34,84,-5,0,0,2,...,2,0.2,0.496,0.499,0.0,0.4,0,"$510,200",2/D,NaN
5,2014,34,KCR,AL,13,31,0,0,0,0,...,1,0.1,0.502,0.500,0.1,0.1,1,NaN,2/D,NaN
6,2015,35,KCR,AL,4,5,-1,0,0,0,...,-1,-0.1,0.465,0.499,-0.1,0.0,-1,"$532,500",/2,NaN
7,2015,35,PHI,NL,12,23,-1,0,0,0,...,0,0.0,0.494,0.500,0.0,0.0,0,NaN,/23,NaN
8,2016,36,HOU,AL,14,30,-6,0,0,1,...,-3,-0.4,0.466,0.497,-0.5,0.2,-4,"$850,000",2/D1,NaN
9,2016,36,PIT,NL,18,57,-9,0,0,1,...,-5,-0.6,0.457,0.495,-0.7,0.2,-6,NaN,2/31,NaN
10,2017,37,NYY,AL,4,2,1,0,0,0,...,1,0.1,0.525,0.501,0.1,0.0,1,NaN,/2D,NaN
11,2018,38,MIL,NL,67,219,-9,0,0,1,...,3,0.1,0.493,0.497,0.1,0.5,2,NaN,2/13,NaN
12,2019,39,SFG,NL,15,36,-3,-1,0,-1,...,-3,-0.3,0.473,0.497,-0.2,0.0,-2,NaN,2,NaN
13,2019,39,TBR,AL,6,17,-4,0,0,0,...,-3,-0.3,0.436,0.498,-0.3,0.0,-3,NaN,/2,NaN

In [9]:
z = Player("zobrist")

I'm 90% sure that you want Ben Zobrist

In [10]:
z.overview().sum()

Year                                               30190
Age                                                  475
Tm         TBDTBDTBRTBRTBRTBRTBRTBRTBROAKKCRCHCCHCCHCCHC
Lg                        ALALALALALALALALALALALNLNLNLNL
G                                                   1651
GS                                                  1528
Batting                                             1651
Defense                                             1586
P                                                      1
C                                                      0
1B                                                    27
2B                                                   911
3B                                                     8
SS                                                   236
LF                                                   223
CF                                                    34
RF                                                   466
OF                                                   661
DH                                                    28
PH                                                    92
PR                                                     4
dtype: object

In [11]:
z.overview().groupby("Tm").sum()

,Year,Age,G,GS,Batting,Defense,P,C,1B,2B,3B,SS,LF,CF,RF,OF,DH,PH,PR
Tm,,,,,,,,,,,,,,,,,,,
CHC,8070,146,461,393,461,433,1,0,10,295,0,7,112,0,130,208,2,51,0
KCR,2015,34,59,58,59,57,0,0,0,35,4,0,18,0,2,20,2,0,0
OAK,2015,34,67,63,67,60,0,0,0,34,0,0,27,0,3,29,4,4,0
TBD,4013,51,83,76,83,82,0,0,0,0,0,82,0,0,0,0,0,3,2
TBR,14077,210,981,938,981,954,0,0,17,547,4,147,66,34,331,404,20,34,2

In [16]:
z.game_logs(2019, log_type="p")

Available tables: ['pitching_gamelogs']

,Rk,Gcar,Gtm,Date,Tm,H/A,Opp,Rslt,Inngs,Dec,...,SF,ROE,aLI,WPA,RE24,DFS(DK),DFS(FD),Entered,Exited,year
0,1,1,162,Sep 29,CHC,A,STL,"L,0-9",8-GF(8),NaN,...,0,0,0.0,0.0,0.52,3.05,6.0,8b --- 0 out d9,8b end d 9,2019

In [15]:
z.overview("pitching_standard")

,Year,Age,Tm,Lg,W,L,W-L%,ERA,G,GS,...,BF,ERA+,FIP,WHIP,H9,HR9,BB9,SO9,SO/W,Awards
0,2019,38,CHC,NL,0,0,NaN,0.0,1,0,...,5,NaN,7.21,2.0,0.0,0.0,18.0,9.0,0.5,NaN